kafka_benchmark_results_20250924_211445/compression/producer-test.log
4997 records sent, 998.0 records/sec (0.97 MB/sec), 9.4 ms avg latency, 367.0 ms max latency.
5008 records sent, 1000.0 records/sec (0.98 MB/sec), 7.0 ms avg latency, 16.0 ms max latency.
12000 records sent, 999.333777 records/sec (0.98 MB/sec), 7.98 ms avg latency, 367.00 ms max latency, 7 ms 50th, 13 ms 95th, 36 ms 99th, 46 ms 99.9th.